Autodesk.Revit.DB.Document.SaveCloudSharedModel(System.Guid,System.String)
After execution, central file resides in A360.
Remarks:
Assumes that worksharing has been enabled for this document and that user is currently signed in
to A360.
projectID:
Identifies the A360 project to which this model will be attached.
modelName:
The name by which the model will be identified in A360.
Returns:
The guid that identifies the model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralModelException:
Could be for any of the reasons that SynchronizeWithCentral fails with CentralModelException, for example, a central model with that name
is already associated to the specified A360 project.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not authorized to access the specified A360 project.
Since:
2015

Autodesk.Revit.DB.Document.SaveAsCloudSharedModel(System.Guid,System.String)
Enables A360 collaboration for this document. After execution, document will represent a local model
whose central file resides in A360.
Remarks:
Assumes that worksharing has been enabled for this document and that user is currently signed in
to A360.
projectID:
Identifies the A360 project to which this model will be attached.
modelName:
The name by which the model will be identified in A360.
Returns:
The guid that identifies the model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralModelException:
Could be for any of the reasons that SynchronizeWithCentral fails with CentralModelException, for example, a central model with that name
is already associated to the specified A360 project.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not authorized to access the specified A360 project.
Since:
2015

Autodesk.Revit.DB.Document.SynchronizeWithCentral(Autodesk.Revit.DB.TransactWithCentralOptions,Autodesk.Revit.DB.SynchronizeWithCentralOptions)
Performs reload latest until the model in the current session is up to date and then saves changes back to central.
A save to central is performed even if no changes were made.
transactOptions:
Options to customize behavior accessing the central model.
syncOptions:
Options to customize behavior of SynchronizeWithCentral.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralFileCommunicationException:
The file-based central model could not be reached, because e.g. the network is down or the file server is down.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied due to lack of access privileges.
-or-
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Username does not match the one used to create the local file.
-or-
Revit could not save all of the worksets that have been changed.  Try again.
-or-
Some of the elements you changed in this model are now editable by someone else, or you checked out worksets that were at risk
or relinquished in the central model but not this file.  You cannot synchronize with the central model until the other user
relinquishes these elements without making changes.
-or-
The central model has been replaced by a local model.
-or-
Local incompatible because it was closed without saving after synchronizing with central.
-or-
The central model is missing.
-or-
The central model is incompatible.
-or-
The central model is corrupt or not an RVT file.
-or-
The central model was rolled back.
-or-
The central model's elements have been relinquished
-or-
Your data or permissions saving is aborted by another user.
-or-
The central model is overritten by other user.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
Cannot access the local file.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
This Document is read-only: It cannot be modified.
-or-
This Document has an open editing transaction and is accepting changes.
-or-
This Document has is in an edit mode or is in family mode.
-or-
Saving is not allowed in the current application mode.
-or-
This Document does not have a central location: Worksharing needs to be enabled and central model saved.
-or-
This Document is a local file that is not owned by the current user, who therefore is not allowed to modify it.
-or-
The local file is read-only.
It can not be saved before or after synchronizing with central.
-or-
Saving local before first reload latest and after saving changes to central
in Synchronize with Central is mandatory for server-based local models.
-or-
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be reached
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
The disk space is running low on server, please contact the server administrator.
-or-
An internal error happened on the server, please contact the server administrator.
Since:
2014

Autodesk.Revit.DB.Document.HasAllChangesFromCentral
Returns whether the model in the current session is up to date with central.
Returns:
True means up to date; false means out of date.
If central is locked but Revit can determine that
the model in the current session is out of date
without opening central, this method will return false
instead of throwing CentralModelContentionException.
Throws Autodesk.Revit.Exceptions.CentralFileCommunicationException:
The file-based central model could not be reached, because e.g. the network is down or the file server is down.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied due to lack of access privileges.
-or-
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Username does not match the one used to create the local file.
-or-
The central model has been replaced by a local model.
-or-
Local incompatible because it was closed without saving after synchronizing with central.
-or-
The central model is missing.
-or-
The central model is incompatible.
-or-
The central model is corrupt or not an RVT file.
-or-
The central model was rolled back.
-or-
The central model's elements have been relinquished
-or-
The central model is overritten by other user.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
Cannot access the local file.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a workshared document.
-or-
This Document is a local file that is not owned by the current user, who therefore is not allowed to modify it.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Since:
2014

Autodesk.Revit.DB.Document.ReloadLatest(Autodesk.Revit.DB.ReloadLatestOptions)
Fetches changes from central (due to one or more synchronizations with central)
and merges them into the current session.
Remarks:
After this call finishes, use hasAllChangesFromCentral to confirm that there were no
Synchronizations with Central performed during execution of ReloadLatest.
reloadOptions:
Various options to control behavior of reloadLatest.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralFileCommunicationException:
The file-based central model could not be reached, because e.g. the network is down or the file server is down.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied due to lack of access privileges.
-or-
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Username does not match the one used to create the local file.
-or-
Revit could not save all of the worksets that have been changed. Try again.
-or-
The central model has been replaced by a local model.
-or-
Local incompatible because it was closed without saving after synchronizing with central.
-or-
The central model is missing.
-or-
The central model is incompatible.
-or-
The central model is corrupt or not an RVT file.
-or-
The central model was rolled back.
-or-
The central model's elements have been relinquished
-or-
The central model is overritten by other user.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
Cannot access the local file.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
This Document is not a local model: it is not workshared or is central.
-or-
This Document is read-only: It cannot be modified.
-or-
This Document has an open editing transaction and is accepting changes.
-or-
This Document has is in an edit mode or is in family mode.
-or-
This Document is a local file that is not owned by the current user, who therefore is not allowed to modify it.
-or-
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Since:
2014